import collections

operations = collections.namedtuple('Операция', ['Наименование', 'Модель_станка', 'N', 'To', 'Tшт', 'Nпр', 'Nрез'])

operation_1 = operations(
    Наименование='010 Автоматная токарная с ЧПУ', Модель_станка='ДФ315', N=5000, To=0.83, Tшт=1.254, Nпр=14, Nрез=1.13)

operation_2 = operations(
    Наименование='020 Токарная с ЧПУ', Модель_станка='16К20Т1', N=5000, To=0.81, Tшт=1.232, Nпр=10, Nрез=1.37)

operation_3 = operations(
    Наименование='030 Вертикально-сверлильная', Модель_станка='2Н135', N=5000, To=0.16, Tшт=0.502, Nпр=4, Nрез=0.06)

operation_4 = operations(
    Наименование='050 Алмазно-расточная', Модель_станка='УМ9000-4045', N=5000, To=0.27, Tшт=0.626, Nпр=11, Nрез=1)

operation_5 = operations(
    Наименование='080 Круглошлифовальная', Модель_станка='3Б151', N=5000, To=0.73, Tшт=1.141, Nпр=7, Nрез=0.56)

operation_6 = operations(
    Наименование='085 Токарная с ЧПУ', Модель_станка='16К20Т1(2)', N=5000, To=0.03, Tшт=0.357, Nпр=10, Nрез=0.75)
